[{"link": "https://investorplace.com/2023/07/dear-aapl-stock-fans-mark-your-calendars-for-july-14/", "title": "Dear AAPL Stock Fans, Mark Your Calendars for July 14", "snippet": "Apple has been dominant so far in 2023, with AAPL stock climbing more than \n40% year to date and hitting new all-time highs.", "date": "22 hours ago", "source": "InvestorPlace", "text": "Apple (NASDAQ:AAPL) commands a top spot among investors’ watchlists — and for good reason. AAPL stock currently sports a market capitalization of $2.95 trillion.\nThe company recently exceeded the $3 trillion market as it continued to carve out new all-time highs. While the stock has seen some mild profit-taking in recent trading, the action has been robust.\nShares still boast a year-to-date gain of 44%. While that lags many of its FAANG peers, it’s the only component of that group to get back to (and exceed) its prior all-time highs.\nSo why should investors keep an eye on AAPL stock?\nOn Friday, July 14, the Nasdaq 100 will announce the results of its special rebalancing. The rebalance, which will take place before the market open on Monday, July 17, will take place to “address overconcentration in the index by redistributing the weights.”\nThis is only the third time the Nasdaq will enact a special rebalance. Previously, it did so in December 1998 and May 2011.\nThe Nasdaq 100 is weighted by market cap, so it’s not hard to understand how the scales have tipped in recent years and more specifically, in 2023. In addition to FAANG, Microsoft (NASDAQ:MSFT), Nvidia (NASDAQ:NVDA) and Tesla (NASDAQ:TSLA) have appreciated considerably this year.\nWhile much of the market has lagged, these names have been surging to the upside. In fact, the worst performer of this group so far in 2023 is Alphabet (NASDAQ:GOOGL, NASDAQ:GOOG), despite sporting a 32.7% year-to-date gain.\nThanks to the current rally, the Nasdaq 100’s top seven holdings — Apple, Alphabet, Tesla, Nvidia, Microsoft, Amazon (NASDAQ:AMZN) and Meta (NASDAQ:META) — make up 55% of the index. Apple holds the No. 2 weighting at 12.5%, just behind Microsoft’s 12.9% weighting.\nWhat’s Next for AAPL Stock?\nThe rebalancing of the Nasdaq 100 will have an impact on Apple headlines, but ultimately, we’re talking about the largest public company on earth. It plays a role in various U.S.-based indices and exchange-traded funds (ETFs), including the S&P 500, Nasdaq and Dow Jones Industrial Average.\nThe bigger focus for AAPL stock will likely be earnings, which are due up in a few weeks. Currently, Apple is scheduled to report earnings on Aug. 3 after the market close.\nWith the firm having already provided a product update for investors via its WWDC event in June, earnings are next. Keep in mind, this will be Apple’s fiscal third-quarter results, with its fourth-quarter results due up in the fall.\nAnalysts expect a down year for earnings and revenue this year, but despite that, investors are gobbling up AAPL stock. Next year’s estimates call for growth, so that will soon be the focus assuming the economy can remain on track.\nFor what it’s worth, the Nasdaq 100 does not have a poor track record following its prior rebalances — although the same size is pretty small.\nWhen it did so in 1998, its six-month and one-year performances were roughly flat and up about 7%, respectively. In 2011, those figures climbed dramatically, to a gain of roughly 28% over the next six months and roughly 100% over the next year.\nOn the date of publication, Bret Kenwell did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.", "stock": "AAPL"}, {"link": "https://www.barrons.com/articles/apple-stock-price-target-b232a6be", "title": "Apple Stock Gets a Price Target Boost. Even a Spending Slowdown Can’t Stop \nthe Gains.", "snippet": "Apple AAPL –1.09% has fallen back from its milestone $3 trillion market \ncapitalization but a new price target implies gains that should carry it \npast that...", "date": "1 day ago", "source": "Barron's", "text": "Apple Stock Gets a Price Target Boost. Even a Spending Slowdown Can’t Stop the Gains.\n- Order Reprints\n- Print Article\nThis copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers visit http://www.djreprints.com.\nhttps://www.barrons.com/articles/apple-stock-price-target-b232a6be", "stock": "AAPL"}, {"link": "https://www.tipranks.com/news/article/apple-stock-nasdaqaapl-near-term-headwinds-could-limit-further-upside", "title": "Apple Stock (NASDAQ:AAPL): Near-Term Headwinds Could Limit Further Upside", "snippet": "Apple's (NASDAQ:AAPL) revenue has declined for two consecutive quarters, as \nmacro pressures continue to weigh on consumer spending on discretionary \nitems.", "date": "11 hours ago", "source": "TipRanks", "text": "Apple’s (NASDAQ:AAPL) revenue has declined for two consecutive quarters, as macro pressures continue to weigh on consumer spending on discretionary items. Nonetheless, AAPL shares have rallied about 55% so far this year amid optimism around generative artificial intelligence (AI) and confidence in the tech giant’s ability to continue to grow in the long term. While most Wall Street analysts remain bullish on Apple, the upside in the stock could be limited in the near term due to ongoing macro pressures.\nAnalysts Stay Bullish on AAPL Stock\nApple’s overall revenue declined 3% year-over-year to about $95 billion in the fiscal second quarter (ended April 1, 2023), following a 5% fall in the prior quarter. High inflation and macro pressures have impacted consumers’ wallets, with discretionary spending taking a backseat. Apple expects its June quarter revenue decline rate to be similar to the March quarter.\nDespite the ongoing challenges, Apple’s iPhone business and its Services segment remain resilient. It is worth noting that iPhone revenue increased 1.5% during Q2 FY23, even as the broader smartphone industry sales plunged as per IDC estimates. Revenue from the company’s higher-margin Services business increased 5.5% in Q2 FY23.\nOn Tuesday, KeyBanc analyst Brandon Nispel increased his price target for Apple stock to $200 from $180 and reiterated a Buy rating on the stock. While the analyst’s long-term view is bullish, he told investors that he is neutral on the stock in the near term due to his below-consensus hardware revenue estimates for Q3 FY23.\nThe analyst explained that the excitement around Apple’s new product launches and investors’ preference for safer bets “is resulting in an elevated multiple” for the stock.\nLast week, Bank of America analyst Wamsi Mohan noted that as per SensorTower data, App Store revenues in Q3 FY23 increased 5.9% year-over-year to $6.6 billion, with total downloads on iPhone and iPad increasing 4.3%. Also, App Store dollars per download grew 1.5% in the fiscal third quarter. Overall Mohan highlighted that App Store trends improved marginally in the June quarter from the March quarter.\nHowever, Mohan continues to have a Hold rating on the stock with a price target of $190 based on risk-reward balance, as positive catalysts related to new product launches (AR/VR headset) and stable iPhone sales are offset by a potentially weaker consumer spending backdrop in the second half of the year.\nIs Apple a Buy, Sell, or Hold?\nWall Street’s Strong Buy consensus rating on AAPL is based on 24 Buys and seven Holds. The average price target of $193.57 implies only 3% upside potential.\nInvestors looking for AAPL’s most accurate and profitable analyst could follow TD Cowen analyst Krish Sankar. Copying the analyst’s trades on this stock and holding each position for one year could result in 96% of your transactions generating a profit, with an average return of 52.4% per trade.\nConclusion\nWhile most Wall Street analysts remain bullish on Apple due to its long-term growth potential backed by production innovation, brand value, and high-margin Services business, the average price target indicates limited upside due to the impact of macro pressures on the tech giant’s business.", "stock": "AAPL"}, {"link": "https://finance.yahoo.com/news/tata-group-inches-closer-becoming-180507779.html", "title": "Tata Group Inches Closer To Becoming India's First iPhone Maker", "snippet": "This story was first published on the Benzinga India portal. Tata Group is \nreportedly on track to buy an Apple Inc (NASDAQ: AAPL) iPhone supplier \nfactory in...", "date": "22 hours ago", "source": "Yahoo Finance", "text": "Tata Group Inches Closer To Becoming India's First iPhone Maker\nThis story was first published on the Benzinga India portal.\nTata Group is reportedly on track to buy an Apple Inc (NASDAQ: AAPL) iPhone supplier factory in India from Wistron Corporation, according to Bloomberg.\nIf the deal goes through by August, this would be the first time a firm based in India produces iPhones.\nWhat Happened? The Karnataka-based factory, valued at over $600 million, employs more than 10,000 people and presently assembles the iPhone 14.\nWistron previously committed to deliver iPhones worth $1.8 billion by March 2024 and triple its workforce by next year. Tata Group plans to uphold these commitments post-acquisition, marking the end of Wistron’s iPhone manufacturing operations in India.\nSee Also: Tata May Be Looking To Ramp Up Semiconductor Play After iPhone Deal\nIndia’s government has been promoting local manufacturing while Apple and its major suppliers, such as Foxconn Group and Pegatron Corporation, are seeking to move their iPhone production out of China. An Indian company producing iPhones could attract more global firms to manufacture in India, reducing their dependence on China.\nAccording to TrendForce, Tata Group might manufacture the upcoming iPhone 15 and iPhone 15 Plus models. They will likely receive smaller orders for these models. This could also mean that India might be included in the initial shipment wave for the new iPhone series, expected to launch in September.\nRead Next: Elon Musk’s Starlink Seeks Green Light To Set Up Earth Stations In India\nPhoto: iPhone 14, Courtesy Apple\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\nThis article Tata Group Inches Closer To Becoming India's First iPhone Maker originally appeared on Benzinga.com\n.\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "stock": "AAPL"}, {"link": "https://www.benzinga.com/news/23/07/33178160/apple-expands-channels-in-china-joins-wechat-e-commerce-platform-alibabas-tmall", "title": "Apple Expands Channels in China, Joins WeChat E-commerce Platform, \nAlibaba's Tmall - Apple (NASDAQ:AAPL)", "snippet": "Tencent Holding Ltd's (OTC: TCEHY) messaging app WeChat announced that \nApple Inc (NASDAQ: AAPL) had opened a store on its platform, expanding \nApple's retail...", "date": "1 day ago", "source": "Benzinga", "text": "Tencent Holding Ltd's TCEHY messaging app WeChat announced that Apple Inc AAPL had opened a store on its platform, expanding Apple's retail channels in the country.\nUsers can purchase Apple products through the WeChat store, including iPhones, iPads, and Macs, Reuters reports.\nApple's move to open a store on WeChat reflects the growing trend of Chinese consumers using social media platforms for shopping.\nAlso Read: The Great Wall of Apple: Despite Production Shifts, China Remains iPhone Maker's Preferred Partner\nChina's smartphone sales in the first quarter fell 5% year on year, marking the lowest first-quarter sales figure for the country since 2014, according to Counterpoint Research.\nDespite declining overall smartphone sales, Apple recorded a 19.9% share of the Chinese smartphone market in the first quarter, the highest since 2014.\nApple's sales in China increased by 6% year-on-year during the quarter, demonstrating its success in a declining market.\nApple already operates a shop on Alibaba Group Holding Limited's BABA Tmall online marketplace, further expanding its presence in the Chinese e-commerce landscape.\nThis new partnership with WeChat adds to Apple's retail network in China and enhances its accessibility to Chinese consumers.\nIn a visit to China in March, Apple CEO Tim Cook met Chinese Premier Li Qiang and other top officials to reaffirm its loyalty to the market.\nApple still relies on Chinese-made components, especially insensitive items like non-chip components, as per Bloomberg analyst Steven Tseng.\nDespite a spate of suppliers' relocation into Southeast Asia and India, Apple has increased its reliance on specific Chinese-made components, like acoustics, glass, connectors, and display panels.\nPrice Actions: AAPL shares closed higher by 0.41% at $189.38 premarket on the last check Tuesday.\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "stock": "AAPL"}, {"link": "https://www.benzinga.com/news/23/07/33180637/nvidia-to-rally-more-than-30-here-are-10-other-analyst-forecasts-for-tuesday", "title": "NVIDIA To Rally More Than 30%? Here Are 10 Other Analyst Forecasts For \nTuesday - Apple (NASDAQ:AAPL), Air", "snippet": "Keybanc boosted NVIDIA Corporation (NASDAQ: NVDA) price target from $500 to \n$550. Keybanc analyst John Vinh maintained an Overweight rating.", "date": "1 day ago", "source": "Benzinga", "text": "- Keybanc boosted NVIDIA Corporation NVDA price target from $500 to $550. Keybanc analyst John Vinh maintained an Overweight rating. NVIDIA shares fell 0.8% to close at $421.80 on Monday.\n- Credit Suisse slashed the price target for FMC Corporation FMC from $120 to $101. Credit Suisse analyst John Roberts maintained an Underperform rating. FMC shares fell 11.2% to close at $92.63 on Monday.\n- Raymond James boosted the price target for Snowflake Inc. SNOW from $170 to $180. Raymond James analyst Simon Leopold maintained an Outperform rating. Snowflake shares fell 0.6% to close at $169.65 on Monday.\n- Wells Fargo increased the price target for Blackstone Inc. BX from $101 to $104. Wells Fargo analyst Timothy O'Shea maintained an Overweight rating. Blackstone shares rose 0.3% to $93.60 in pre-market trading.\n- Benchmark raised XPO, Inc. XPO price target from $53 to $65. Benchmark analyst Christopher Kuhn maintained a Buy rating. XPO shares fell 0.9% to $59.53 in pre-market trading.\n- Mizuho boosted HCA Healthcare, Inc. HCA price target from $305 to $325. Mizuho analyst Ann Hynes maintained a Buy rating. HCA Healthcare shares rose 0.1% to $295.76 in pre-market trading.\n- Citigroup raised CSX Corporation CSX price target from $37 to $39.. Citigroup analyst Christian Wetherbee maintained a Buy rating. CSX shares rose 0.9% to close at $33.61 on Monday.\n- Barclays boosted Marathon Petroleum Corporation MPC price target from $124 to $132. Barclays analyst Theresa Chen maintained an Overweight rating. Marathon Petroleum shares fell 0.2% to close at $117.84 on Monday.\n- Keybanc raised the price target for Apple Inc. AAPL from $180 to $200. Keybanc analyst Brandon Nispel maintained an Overweight rating. Apple shares fell 1.1% to close at $188.61 on Monday.\n- Jefferies increased JPMorgan Chase & Co. JPM price target from $149 to $165. Jefferies analyst Ken Usdin upgraded the stock from Hold to Buy. JPMorgan shares gained 0.6% to close at $145.15 on Monday.\n- Needham boosted Airbnb, Inc. ABNB price target from $150 to $160. Needham analyst Bernie McTernan maintained a Buy rating. Airbnb shares fell 0.6% to $130.99 in pre-market trading.\nCheck This Out: JetBlue Airways, VOXX International And Other Big Stocks Moving Lower In Tuesday's Pre-Market Session\nEarnings\nAnalyst Ratings\nOptions\nDividends\nIPOs\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "stock": "AAPL"}, {"link": "https://seekingalpha.com/article/4616067-apple-modest-growth-extreme-valuation", "title": "Apple (AAPL) Stock: Modest Growth And Extreme Valuation", "snippet": "Apple is a high-tech company that is busy developing its own ecosystem. \nClick here to find out our updated outlook on AAPL stock.", "date": "2 days ago", "source": "Seeking Alpha", "text": "Apple: Modest Growth And Extreme Valuation\nSummary\n- Apple’s revenue totaled $94.8 bln (-2.5% y/y), compared with our forecast of $109 bln.\n- Apple’s EBITDA totaled $31.2 bln (-5% y/y), compared with our forecast of $36 bln. The result missed our expectations due to a lower revenue.\n- Apple unveiled an augmented reality headset, Vision Pro, to be released in 2024, with potential revenue from the product expected to total $4 billion in 2024 and rise to $4.8.\n- Demand on the global market of devices remained weak.\nInvestment Thesis\nDemand in the global market of devices remained weak. Apple (NASDAQ:AAPL) sold 58 mln (-2% y/y) iPhones, 12.4 mln iPads (-17% y/y), 4.4 mln Macs (-38% y/y), and 10 mln Watches (-32% y/y) in 2Q 2023. Markets declined more than we had expected, prompting us to reduce the forecast for 2023 shipments in all segments of Apple's products. We rate the stock a sell.\nSmartphones Market\nThe global market of smartphones has fallen for a fifth straight quarter. The total smartphone shipments dropped by 13% y/y in 1Q 2023 (2Q 2023 of Apple's fiscal year).\nFalling real incomes and the weak recovery of demand in China have prompted the downward trend in the smartphone market to continue. The poor stratum of the population has been hit the hardest by high inflation, which is the reason why the biggest decline in sales was observed in the segment of cheap smartphones. It didn't help that sweeping advertising campaigns were launched touting discounts, so that retailers could destock (sell off their inventories). It is expected that total smartphone inventories will return to a healthy level in the next few quarters.\nApple sold about 58 mln iPhones (-2% y/y), more than anyone else in the industry thanks to its exposure to middle and high-income audience. Apple's share of the entire market climbed to 21% (+3 pp y/y) in 1Q 2023. The market share of its key rivals - Samsung and Xiaomi - slid to 22% (-2 pp y/y) and 11% (-2 pp y/y), respectively.\nAs weak demand is putting a greater pressure on the smartphones market than expected, we are lowering the forecast for total smartphone sales in 2023 from 1220.4 mln units (+2.3% y/y) to 1193.2 mln units (+0% y/y), with the recovery accelerating toward 4Q 2023. We are also lowering the forecast for 2024 from 1290 mln units (+5.7% y/y) to 1224 mln units (+2.6% y/y) as the effect of inventory normalization is being pushed back.\nAs a result, we are lowering the forecast for iPhone shipments in 2023 from 245 mln units (-0.4% y/y) to 232 mln units (-5.7% y/y).\niPad Segment\nThe tablet market was down 18% y/y in 1Q 2023. For the most part, the tablet market declined for the same reasons as the smartphone market. The only exception was the holiday period in 4Q 2022, when tablet manufacturers offered massive discounts, which helped to keep the market afloat, with a growth of 1% y/y in that period. In the smartphone market, massive discounts came from dealers in 1Q 2023, in order to achieve a healthier level of inventories.\nApple retained its leadership in the tablet market in 1Q 2023, selling 12.3 mln devices (-17% y/y), which made up 38.9% of the market (+0.3 pp y/y). Apple's competition in this market is Samsung with a 21.2% market share (+0.8 pp y/y) and Amazon with a 7.9% market share (-1.4 pp y/y).\nGiven a steeper decline in the tablet market than we expected, we are lowering our forecast for iPad sales from 70.5 mln units (+11% y/y) to 59.7 mln units (-5.6% y/y) for 2023, and from 75.8 mln units (+7.5% y/y) tp 62.5 mln units (+4.6% y/y) for 2024.\nMac Segment\nTotal PC shipments fell by 28% y/y in 1Q 2023 due to declining real incomes and sweeping corporate layoffs. Apple showed one of the worst performances in the sector. Sales of Macs fell to 4.4 mln units (-38% y/y). The stronger drop, compared with the rest of the sector, is attributable to the longer life cycle of Apple's devices, which means more time elapses before Apple devices are replaced, compared with the competition.\nDue to the stronger pressure that's exerted on Apple's sales by the market's macro environment, we are lowering the forecast for Mac sales from 29.8 mln units (+4.2% y/y) to 23.9 mln units (-16% y/y) for 2023, and from 31.3 mln units (+5% y/y) to 24.4 mln units (+2% y/y) for 2024.\nFor the iPad and Mac segment as a whole, we had expected a positive y/y sales performance in 2023, due to the superiority of Apple devices in their niches and the release of even more powerful devices, similar to the performance on the smartphone market. But our expectations have not materialized and Apple's sales in these markets are the closest to the performance of its competition. Additional pressure on the PC and tablet markets comes from the weak recovery in China, which is the largest consumer of devices.\nApple Vision Pro\nAt its Worldwide Developers Conference on June 5, Apple unveiled an augmented reality headset, which the company plans to release at the start of 2024 (tentatively, in 2Q of Apple's fiscal year 2024).\nAccording to Statista, the global market of AR headsets will total $2.36 bln (+127% y/y) in 2023, and the market of AR software $11.58 bln (+10% y/y). The potential value of the AR&VR market is estimated to total $52 bln by 2027 (meaning a CAGR of +14% y/y).\nTwo key things to note about Vision Pro are that it's the first new product from Apple after the release of the Apple Watch more than 10 years ago; and that the price of the new gadget will be $3499, which is significantly more expensive, compared to the competition in both the AR and VR segments.\nApple's headset will run on its own operating system called visionOS, which is the world's first spatial OS. The proprietary OS allows the user to interact with digital content without using controllers (an important difference from the alternatives). Instead, the OS responds to natural user movements (eye and hand movements, and voice commands). The headset also supports ultra-high-resolution displays with 23 million pixels, which is significantly more than existing devices have.\nThe main rival product on the market is Meta Quest Pro, which offers a similar option to switch between virtual and mixed realities. Meta Quest Pro has been on the market since 2022, selling at $999 and offering access to the entire Oculus ecosystem.\nThe market of AR/VR headsets is fairly young and unstable from the perspective of its participants. It has fairly long been dominated, almost exclusively, by Meta's Oculus, which aggregated more than 80% of the market in 4Q 2022. Sony PSVR 2 came to market in February 2023, grabbing 35.9% of the total VR/AR headset market over a little less than 1 ½ months. Oculus headsets continued to dominate, but their share slumped from 81% of the market to 47.8% over the first quarter.\nThe VR/AR market has declined by 54.4% y/y in terms of units, with the drop mostly affecting VR headsets. If we single out AR headsets alone, this segment expanded by 12% y/y due to products released by Xreal, a player confined to an extremely small niche.\nSony, which has just returned to the market, has quickly enough won back attention in the VR/AR market, which only reaffirms that the market is in the early phase of user interest. Therefore, when analyzing Apple's potential performance, the focus should be on sales in terms of units. Especially since Apple is not competing with Oculus and Sony for the best price, with those companies offering their devices at $599 to $999 depending on the model.\nApple expects it will sell about 1 mln headsets in 2024 (compared with the total of 8.8 mln headsets that were sold in 2022). Different analysts have quite a wide range of estimates for potential sales. KGI Securities believes that Apple will sell only 200 thousand units, while CS analysts expect sales of more than 1 mln units. If the company manages to sell 1 mln units in 2024, that would bring in about $3.5 bln in revenue from the gadget sales alone.\nIt's worth bearing in mind that the Vision Pro will be built into Apple's wider product ecosystem, and most of the projected AR market for 2024 is made up by advertising and software sales (total gadget sales will account for only $4.4 bln of $22 bln).\nAs a result, Apple could earn not only the $3.5 bln in revenue from gadget sales but also about $500 mln in average fees from software companies that operate using Apple infrastructure.\nWe do not expect Apple to dominate the general VR/AR device market as it does the smartphone market, where the company has a 20% market share in terms of units and 80% in terms of profit. That's because the market is now shaped by major players with their own developed ecosystems: Oculus and Sony\nThe bottom line is that we expect revenue from the product to total $4 bln in 2024 and rise to $4.8 bln in 2025.\nEBITDA from the product, including services - assuming Apple products have an average margin of 35%, and Apple services have an average margin of 70% - could reach $1.6 bln in 2024 and $1.9 bln in 2025.\nRevenue and EBITDA from Vision Pro will make up about 1% of the company's total revenue.\nApple's Financial Results\nDue to the downward revision of the performance of the main device markets where Apple has a presence, and as we add revenue from Vision Pro, we are lowering the revenue forecast from $420.1 bln (+6.5% y/y) to $391 bln (-0.1% y/y) for 2023 and from $465.6 bln (+10.8% y/y) to $428.5 bln (+9.6% y/y) for 2024.\nWe are also lowering the EBITDA forecast from $133.6 bln (+2.3% y/y) to $124.2 bln (-0.5% y/y) for 2023 and from $145.2 bln (+8.7% y/y) to $134.8 bln (+8.5% y/y) for 2024.\nValuation\nAccording to our estimates, the fair value price of the stock is $129. Target price was obtained as the average between the two evaluation methods. Rating is sell.\nConclusion\nApple is a high-tech company that is busy developing its own ecosystem. However, recent trends in the smartphone market significantly limit its growth potential. The current business growth rates do not correspond to such an inflated valuation. We believe the Apple stock rally is coming to an end. Rating is sell.\nThis article was written by\nAnalyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.\nComments (52)\nI honestly don't know if I will ever use Vision Pro, but like most AAPL products they have a way of moving American culture along. I am a dyed in the wool AAPL fan from way back when it was $13/sh. There is always a fluctuation in the share price as time goes on. Part of the fluctuation is in reaction to cheap copies of AAPL that seem like a good deal....but turn out to be duds.\nיוי\nYep very long ago.\n--\n\"@nate311\nYep very long ago.\"\n--\n**Not “very long ago”, my dripped AAPL dividends bought new AAPL shares at $147.64 on 11/10/22 and at $152.24 on 02/16/23. Yesterday, AAPL closed at $188.61/share.A gain like that, in less than one year, isn’t too bad, IMO.\nNVDA 219\nTSLA 79\nMSFT 36\nGLW 33Alrighty then…", "stock": "AAPL"}, {"link": "https://www.fool.com/investing/2023/07/10/heres-my-top-stock-to-buy-now-and-its-not-even-clo/", "title": "Here's My Top Stock to Buy Now--And It's Not Even Close", "snippet": "This company's stock is potentially one of the safest long-term investments \navailable.", "date": "2 days ago", "source": "The Motley Fool", "text": "The stock market has been in recovery mode this year after a dramatic sell-off in 2022 brought on by macroeconomic headwinds. Easing inflation has rallied investors and led the Nasdaq Composite index to rise 31% since Jan. 1. As a result, it's not a bad time to consider investing in solid growth stocks with a history of consistent gains before they rise higher.\nApple (AAPL 0.54%) is by far my top pick right now, with its potent brand and popular products likely to keep the company growing for decades. The tech giant's stock has soared 48% year to date, making it the first company to surpass a market cap of $3 trillion. However, the company still has a solid long-term outlook, making it a compelling buy to hold over the next decade.\nHere's why Apple is my top stock to buy right now.\nA stock that won't stop\nThere's been some criticism surrounding Apple's stock rise this year, with analysts pointing to its price-to-earnings ratio of 33, which indicates it's currently overvalued. The concern is well founded, and the company's shares are on the expensive side. However, its high price point further reflects the stability and low volatility of its stock.\nIn the first two quarters of 2023, Apple has reported year-over-year revenue declines of 5% and 3% as it recovers from an economically challenging 2022. Yet investors have continued to trust the long-term prospects of the company, keeping its stock trending up. While many companies might suffer significant stock declines after such earnings results, Wall Street sees Apple's short-term hurdles as investment opportunities.\nThe company's consistency is evident in its five-year stock growth. As seen in the chart above, Apple has enjoyed a significantly higher stock increase since 2018 than any other company in the \"Big Five\" of tech. Apple's focus on delivering high-quality products and services to consumers has granted it immense brand loyalty and allowed its business to continue on a growth path.\nOver the long term, the company's leading market shares in multiple areas of its product lineup suggest it will retain its $3 trillion market cap, with the potential to soar far higher.\nSlowly diversifying its earnings away from the iPhone\nApple's highest-earnings product by far is the iPhone. The smartphone segment regularly earns over 50% of its revenue, and has become a useful tool to attract consumers to its other offerings. However, with so much of Apple's business riding on the iPhone, it can feel risky to dedicate a large amount of your portfolio to the company. But the tech giant is on a path that is gradually allowing it to lean less on iPhone sales.\nIn 2019 Apple made a massive push into digital services with the launch of Apple TV+, Arcade, News+, and Fitness+. The company had already entered the industry with its Music platform in 2015, but the further expansion into subscription-based services has led its related segment to become the second-highest-earning part of its business. What's more, services revenue growth came to 14% last year, double the iPhone's growth.\nMeanwhile, the digital side of the business provides attractive profit margins, with services hitting 72% in 2022. Comparatively, product profit margins came to 36% in the same period.\nMoreover, the recent debut of Apple's first virtual/augmented reality (VR/AR) headset, the Vision Pro, could further diversify its earnings in the long run. The device has debuted at a starting price of $3,499, pricing out many consumers. However, future iterations of the device could see Apple bring down the price and make it more accessible to the masses. If done right, the Vision Pro has the potential to bolster the company's services business as consumers seek entertainment options for the headset and pave a path for Apple to become the leader of the high-growth VR/AR sector.\nApple is dominating consumer tech, which has allowed it to build a lucrative services business. As it continues to diversify its earnings, the company is easily one of the most reliable long-term investments available. Its P/E may be high, but holding its stock for the next five to ten years will likely offer far higher gains.", "stock": "AAPL"}]